# Способ 1 через списки:
num = int(input('Введите номер месяца от 1 до 12: '))
list = ['Зима', 'Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень']
if num < 12:
    print(f'Это {list[num]}')
else:
    print(list[0])
# Способ 2 через словарь:
num = int(input('Введите номер месяца от 1 до 12: '))
mydict = {1:"Зима", 2:'Зима', 3:'Весна', 4:'Весна', 5:'Весна', 6:'Лето', 7:'Лето', 8:'Лето', 9:'Осень', 10:'Осень', 11:'Осень', 12:'Зима'}
print(f'Это {mydict.get(num)}')